Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/fcw.h
/* -------- FCW_STATUS : (FCW Offset: 0x1C) ( R/ 32) Status REGISTER -------- */
#define FCW_STATUS_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCW_STATUS) Status REGISTER  Reset Value */

#define FCW_STATUS_BUSY_Pos                   _UINT32_(0)                                          /* (FCW_STATUS) NVM Busy Status Position */
#define FCW_STATUS_BUSY_Msk                   (_UINT32_(0x1) << FCW_STATUS_BUSY_Pos)               /* (FCW_STATUS) NVM Busy Status Mask */
#define FCW_STATUS_BUSY(value)                (FCW_STATUS_BUSY_Msk & (_UINT32_(value) << FCW_STATUS_BUSY_Pos)) /* Assignment of value for BUSY in the FCW_STATUS register */
#define   FCW_STATUS_BUSY_IDLE_Val            _UINT32_(0x0)                                        /* (FCW_STATUS) NVM Not Busy  */
#define   FCW_STATUS_BUSY_BUSY_Val            _UINT32_(0x1)                                        /* (FCW_STATUS) NVM Busy - All SFR bits are not writable  */
#define FCW_STATUS_BUSY_IDLE                  (FCW_STATUS_BUSY_IDLE_Val << FCW_STATUS_BUSY_Pos)    /* (FCW_STATUS) NVM Not Busy Position */
#define FCW_STATUS_BUSY_BUSY                  (FCW_STATUS_BUSY_BUSY_Val << FCW_STATUS_BUSY_Pos)    /* (FCW_STATUS) NVM Busy - All SFR bits are not writable Position */
#define FCW_STATUS_HTDRDY_Pos                 _UINT32_(8)                                          /* (FCW_STATUS) High Temp Detect Ready Status Position */
#define FCW_STATUS_HTDRDY_Msk                 (_UINT32_(0x1) << FCW_STATUS_HTDRDY_Pos)             /* (FCW_STATUS) High Temp Detect Ready Status Mask */
#define FCW_STATUS_HTDRDY(value)              (FCW_STATUS_HTDRDY_Msk & (_UINT32_(value) << FCW_STATUS_HTDRDY_Pos)) /* Assignment of value for HTDRDY in the FCW_STATUS register */
#define   FCW_STATUS_HTDRDY_NOTREADY_Val      _UINT32_(0x0)                                        /* (FCW_STATUS) HTD Not Ready  */
#define   FCW_STATUS_HTDRDY_READY_Val         _UINT32_(0x1)                                        /* (FCW_STATUS) HTD Ready  */
#define FCW_STATUS_HTDRDY_NOTREADY            (FCW_STATUS_HTDRDY_NOTREADY_Val << FCW_STATUS_HTDRDY_Pos) /* (FCW_STATUS) HTD Not Ready Position */
#define FCW_STATUS_HTDRDY_READY               (FCW_STATUS_HTDRDY_READY_Val << FCW_STATUS_HTDRDY_Pos) /* (FCW_STATUS) HTD Ready Position */
#define FCW_STATUS_Msk                        _UINT32_(0x00000101)                                 /* (FCW_STATUS) Register Mask  */


/* -------- FCW_KEY : (FCW Offset: 0x20) (R/W 32) Feature Unlock Key REGISTER -------- */
#define FCW_KEY_RESETVALUE                    _UINT32_(0x00)                                       /*  (FCW_KEY) Feature Unlock Key REGISTER  Reset Value */

#define FCW_KEY_FEATURE_Pos                   _UINT32_(0)                                          /* (FCW_KEY) Feature Select Position */
#define FCW_KEY_FEATURE_Msk                   (_UINT32_(0xFF) << FCW_KEY_FEATURE_Pos)              /* (FCW_KEY) Feature Select Mask */
#define FCW_KEY_FEATURE(value)                (FCW_KEY_FEATURE_Msk & (_UINT32_(value) << FCW_KEY_FEATURE_Pos)) /* Assignment of value for FEATURE in the FCW_KEY register */
#define   FCW_KEY_FEATURE_LOCKALL_Val         _UINT32_(0x0)                                        /* (FCW_KEY) No selection, invalid selection, or invalid Key - Locks all SFR protected by KEY register  */
#define   FCW_KEY_FEATURE_WRKEY_Val           _UINT32_(0x1)                                        /* (FCW_KEY) WRKEY Value: Unlock SFR bits associated with Write/Erase  */
#define   FCW_KEY_FEATURE_SWAPKEY_Val         _UINT32_(0x2)                                        /* (FCW_KEY) SWAPKEY Value: Unlock SFR bits associated with Panel Swapping  */
#define   FCW_KEY_FEATURE_CFGKEY_Val          _UINT32_(0x4)                                        /* (FCW_KEY) CFGKEY Value: Unlock SFR bits associated with general Flash configuration  */
#define FCW_KEY_FEATURE_LOCKALL               (FCW_KEY_FEATURE_LOCKALL_Val << FCW_KEY_FEATURE_Pos) /* (FCW_KEY) No selection, invalid selection, or invalid Key - Locks all SFR protected by KEY register Position */
#define FCW_KEY_FEATURE_WRKEY                 (FCW_KEY_FEATURE_WRKEY_Val << FCW_KEY_FEATURE_Pos)   /* (FCW_KEY) WRKEY Value: Unlock SFR bits associated with Write/Erase Position */
#define FCW_KEY_FEATURE_SWAPKEY               (FCW_KEY_FEATURE_SWAPKEY_Val << FCW_KEY_FEATURE_Pos) /* (FCW_KEY) SWAPKEY Value: Unlock SFR bits associated with Panel Swapping Position */
#define FCW_KEY_FEATURE_CFGKEY                (FCW_KEY_FEATURE_CFGKEY_Val << FCW_KEY_FEATURE_Pos)  /* (FCW_KEY) CFGKEY Value: Unlock SFR bits associated with general Flash configuration Position */
#define FCW_KEY_CODE_Pos                      _UINT32_(8)                                          /* (FCW_KEY) Unlock Code Position */
#define FCW_KEY_CODE_Msk                      (_UINT32_(0xFFFFFF) << FCW_KEY_CODE_Pos)             /* (FCW_KEY) Unlock Code Mask */
#define FCW_KEY_CODE(value)                   (FCW_KEY_CODE_Msk & (_UINT32_(value) << FCW_KEY_CODE_Pos)) /* Assignment of value for CODE in the FCW_KEY register */
#define FCW_KEY_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (FCW_KEY) Register Mask  */


/* -------- FCW_ADDR : (FCW Offset: 0x24) (R/W 32) Flash Destination Address REGISTER -------- */
#define FCW_ADDR_RESETVALUE                   _UINT32_(0x00)                                       /*  (FCW_ADDR) Flash Destination Address REGISTER  Reset Value */

#define FCW_ADDR_ADDR_Pos                     _UINT32_(0)                                          /* (FCW_ADDR) Flash Address used by NVMOP Position */
#define FCW_ADDR_ADDR_Msk                     (_UINT32_(0xFFFFFFFF) << FCW_ADDR_ADDR_Pos)          /* (FCW_ADDR) Flash Address used by NVMOP Mask */
#define FCW_ADDR_ADDR(value)                  (FCW_ADDR_ADDR_Msk & (_UINT32_(value) << FCW_ADDR_ADDR_Pos)) /* Assignment of value for ADDR in the FCW_ADDR register */
#define FCW_ADDR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (FCW_ADDR) Register Mask  */


/* -------- FCW_SRCADDR : (FCW Offset: 0x28) (R/W 32) System Source Address REGISTER -------- */
#define FCW_SRCADDR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCW_SRCADDR) System Source Address REGISTER  Reset Value */

