Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/fcw.h
/* -------- FCW_PWP : (FCW Offset: 0x50) (R/W 32) PFM Write Protect Region n REGISTER -------- */
#define FCW_PWP_RESETVALUE                    _UINT32_(0x00)                                       /*  (FCW_PWP) PFM Write Protect Region n REGISTER  Reset Value */

#define FCW_PWP_PWPSIZE_Pos                   _UINT32_(0)                                          /* (FCW_PWP) PWP Size in 4KB pages Position */
#define FCW_PWP_PWPSIZE_Msk                   (_UINT32_(0x7F) << FCW_PWP_PWPSIZE_Pos)              /* (FCW_PWP) PWP Size in 4KB pages Mask */
#define FCW_PWP_PWPSIZE(value)                (FCW_PWP_PWPSIZE_Msk & (_UINT32_(value) << FCW_PWP_PWPSIZE_Pos)) /* Assignment of value for PWPSIZE in the FCW_PWP register */
#define FCW_PWP_PWPMIR_Pos                    _UINT32_(13)                                         /* (FCW_PWP) Mirror PWP bit Position */
#define FCW_PWP_PWPMIR_Msk                    (_UINT32_(0x1) << FCW_PWP_PWPMIR_Pos)                /* (FCW_PWP) Mirror PWP bit Mask */
#define FCW_PWP_PWPMIR(value)                 (FCW_PWP_PWPMIR_Msk & (_UINT32_(value) << FCW_PWP_PWPMIR_Pos)) /* Assignment of value for PWPMIR in the FCW_PWP register */
#define   FCW_PWP_PWPMIR_UNMIRROR_Val         _UINT32_(0x0)                                        /* (FCW_PWP) PWP settings are NOT Mirrored  */
#define   FCW_PWP_PWPMIR_MIRROR_Val           _UINT32_(0x1)                                        /* (FCW_PWP) PWP settings are Mirrored  */
#define FCW_PWP_PWPMIR_UNMIRROR               (FCW_PWP_PWPMIR_UNMIRROR_Val << FCW_PWP_PWPMIR_Pos)  /* (FCW_PWP) PWP settings are NOT Mirrored Position */
#define FCW_PWP_PWPMIR_MIRROR                 (FCW_PWP_PWPMIR_MIRROR_Val << FCW_PWP_PWPMIR_Pos)    /* (FCW_PWP) PWP settings are Mirrored Position */
#define FCW_PWP_PWPLOCK_Pos                   _UINT32_(14)                                         /* (FCW_PWP) PWP Lock Bit Position */
#define FCW_PWP_PWPLOCK_Msk                   (_UINT32_(0x1) << FCW_PWP_PWPLOCK_Pos)               /* (FCW_PWP) PWP Lock Bit Mask */
#define FCW_PWP_PWPLOCK(value)                (FCW_PWP_PWPLOCK_Msk & (_UINT32_(value) << FCW_PWP_PWPLOCK_Pos)) /* Assignment of value for PWPLOCK in the FCW_PWP register */
#define   FCW_PWP_PWPLOCK_UNLOCKED_Val        _UINT32_(0x0)                                        /* (FCW_PWP) This register is Not Locked and can be modified  */
#define   FCW_PWP_PWPLOCK_LOCKED_Val          _UINT32_(0x1)                                        /* (FCW_PWP) This register is Locked and cannot be modified  */
#define FCW_PWP_PWPLOCK_UNLOCKED              (FCW_PWP_PWPLOCK_UNLOCKED_Val << FCW_PWP_PWPLOCK_Pos) /* (FCW_PWP) This register is Not Locked and can be modified Position */
#define FCW_PWP_PWPLOCK_LOCKED                (FCW_PWP_PWPLOCK_LOCKED_Val << FCW_PWP_PWPLOCK_Pos)  /* (FCW_PWP) This register is Locked and cannot be modified Position */
#define FCW_PWP_PWPEN_Pos                     _UINT32_(15)                                         /* (FCW_PWP) PWP Enable Bit Position */
#define FCW_PWP_PWPEN_Msk                     (_UINT32_(0x1) << FCW_PWP_PWPEN_Pos)                 /* (FCW_PWP) PWP Enable Bit Mask */
#define FCW_PWP_PWPEN(value)                  (FCW_PWP_PWPEN_Msk & (_UINT32_(value) << FCW_PWP_PWPEN_Pos)) /* Assignment of value for PWPEN in the FCW_PWP register */
#define   FCW_PWP_PWPEN_DISABLE_Val           _UINT32_(0x0)                                        /* (FCW_PWP) PWP is Not Enabled for the defined region  */
#define   FCW_PWP_PWPEN_ENABLE_Val            _UINT32_(0x1)                                        /* (FCW_PWP) PWP is Enabled for the defined region  */
#define FCW_PWP_PWPEN_DISABLE                 (FCW_PWP_PWPEN_DISABLE_Val << FCW_PWP_PWPEN_Pos)     /* (FCW_PWP) PWP is Not Enabled for the defined region Position */
#define FCW_PWP_PWPEN_ENABLE                  (FCW_PWP_PWPEN_ENABLE_Val << FCW_PWP_PWPEN_Pos)      /* (FCW_PWP) PWP is Enabled for the defined region Position */
#define FCW_PWP_PWPBASE_Pos                   _UINT32_(16)                                         /* (FCW_PWP) PWP Base Address - 4KB Page Aligned Position */
#define FCW_PWP_PWPBASE_Msk                   (_UINT32_(0x7F) << FCW_PWP_PWPBASE_Pos)              /* (FCW_PWP) PWP Base Address - 4KB Page Aligned Mask */
#define FCW_PWP_PWPBASE(value)                (FCW_PWP_PWPBASE_Msk & (_UINT32_(value) << FCW_PWP_PWPBASE_Pos)) /* Assignment of value for PWPBASE in the FCW_PWP register */
#define FCW_PWP_Msk                           _UINT32_(0x007FE07F)                                 /* (FCW_PWP) Register Mask  */


/* -------- FCW_LBWP : (FCW Offset: 0x70) (R/W 32) Lower BFM Write Protect REGISTER -------- */
#define FCW_LBWP_RESETVALUE                   _UINT32_(0x03)                                       /*  (FCW_LBWP) Lower BFM Write Protect REGISTER  Reset Value */

#define FCW_LBWP_LBWP_Pos                     _UINT32_(0)                                          /* (FCW_LBWP) Lower Boot Pages Write Protect Bits Position */
#define FCW_LBWP_LBWP_Msk                     (_UINT32_(0x3) << FCW_LBWP_LBWP_Pos)                 /* (FCW_LBWP) Lower Boot Pages Write Protect Bits Mask */
#define FCW_LBWP_LBWP(value)                  (FCW_LBWP_LBWP_Msk & (_UINT32_(value) << FCW_LBWP_LBWP_Pos)) /* Assignment of value for LBWP in the FCW_LBWP register */
#define   FCW_LBWP_LBWP_DISABLE_Val           _UINT32_(0x0)                                        /* (FCW_LBWP) Erase and Write Protection for this Lower Boot Page is Disabled  */
#define   FCW_LBWP_LBWP_ENABLE_Val            _UINT32_(0x1)                                        /* (FCW_LBWP) Erase and Write Protection for this Lower Boot Page is Enabled  */
#define FCW_LBWP_LBWP_DISABLE                 (FCW_LBWP_LBWP_DISABLE_Val << FCW_LBWP_LBWP_Pos)     /* (FCW_LBWP) Erase and Write Protection for this Lower Boot Page is Disabled Position */
#define FCW_LBWP_LBWP_ENABLE                  (FCW_LBWP_LBWP_ENABLE_Val << FCW_LBWP_LBWP_Pos)      /* (FCW_LBWP) Erase and Write Protection for this Lower Boot Page is Enabled Position */
#define FCW_LBWP_LBWPLOCK_Pos                 _UINT32_(31)                                         /* (FCW_LBWP) LBWP Lock Bit Position */
#define FCW_LBWP_LBWPLOCK_Msk                 (_UINT32_(0x1) << FCW_LBWP_LBWPLOCK_Pos)             /* (FCW_LBWP) LBWP Lock Bit Mask */
#define FCW_LBWP_LBWPLOCK(value)              (FCW_LBWP_LBWPLOCK_Msk & (_UINT32_(value) << FCW_LBWP_LBWPLOCK_Pos)) /* Assignment of value for LBWPLOCK in the FCW_LBWP register */
#define   FCW_LBWP_LBWPLOCK_UNLOCKED_Val      _UINT32_(0x0)                                        /* (FCW_LBWP) This register is NOT Locked and can be modified  */
#define   FCW_LBWP_LBWPLOCK_LOCKED_Val        _UINT32_(0x1)                                        /* (FCW_LBWP) This register is Locked and cannot be modified  */
#define FCW_LBWP_LBWPLOCK_UNLOCKED            (FCW_LBWP_LBWPLOCK_UNLOCKED_Val << FCW_LBWP_LBWPLOCK_Pos) /* (FCW_LBWP) This register is NOT Locked and can be modified Position */
#define FCW_LBWP_LBWPLOCK_LOCKED              (FCW_LBWP_LBWPLOCK_LOCKED_Val << FCW_LBWP_LBWPLOCK_Pos) /* (FCW_LBWP) This register is Locked and cannot be modified Position */
#define FCW_LBWP_Msk                          _UINT32_(0x80000003)                                 /* (FCW_LBWP) Register Mask  */


