Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/fcw.h
#define FCW_CWP_VSSWP_Pos                     _UINT32_(4)                                          /* (FCW_CWP Position) Panel x Write Protect VSSn */
#define FCW_CWP_VSSWP_Msk                     (_UINT32_(0x3) << FCW_CWP_VSSWP_Pos)                 /* (FCW_CWP Mask) VSSWP */
#define FCW_CWP_VSSWP(value)                  (FCW_CWP_VSSWP_Msk & (_UINT32_(value) << FCW_CWP_VSSWP_Pos)) 
#define FCW_CWP_VSSWPLOCK_Pos                 _UINT32_(20)                                         /* (FCW_CWP Position) Panel x Lock Write Protection VSSn */
#define FCW_CWP_VSSWPLOCK_Msk                 (_UINT32_(0x3) << FCW_CWP_VSSWPLOCK_Pos)             /* (FCW_CWP Mask) VSSWPLOCK */
#define FCW_CWP_VSSWPLOCK(value)              (FCW_CWP_VSSWPLOCK_Msk & (_UINT32_(value) << FCW_CWP_VSSWPLOCK_Pos)) 

/* FCW register offsets definitions */
#define FCW_CTRLA_REG_OFST             _UINT32_(0x00)      /* (FCW_CTRLA) Control A REGISTER Offset */
#define FCW_CTRLOP_REG_OFST            _UINT32_(0x04)      /* (FCW_CTRLOP) Control Operation REGISTER Offset */
#define FCW_MUTEX_REG_OFST             _UINT32_(0x08)      /* (FCW_MUTEX) MUTEX REGISTER Offset */
#define FCW_INTENCLR_REG_OFST          _UINT32_(0x0C)      /* (FCW_INTENCLR) Interrupt Enable Clear REGISTER Offset */
#define FCW_INTENSET_REG_OFST          _UINT32_(0x10)      /* (FCW_INTENSET) Interrupt Enable Set REGISTER Offset */
#define FCW_INTFLAG_REG_OFST           _UINT32_(0x14)      /* (FCW_INTFLAG) Interrupt Flag REGISTER Offset */
#define FCW_INTFLAGSET_REG_OFST        _UINT32_(0x18)      /* (FCW_INTFLAGSET) Interrupt Flag Set REGISTER Offset */
#define FCW_STATUS_REG_OFST            _UINT32_(0x1C)      /* (FCW_STATUS) Status REGISTER Offset */
#define FCW_KEY_REG_OFST               _UINT32_(0x20)      /* (FCW_KEY) Feature Unlock Key REGISTER Offset */
#define FCW_ADDR_REG_OFST              _UINT32_(0x24)      /* (FCW_ADDR) Flash Destination Address REGISTER Offset */
#define FCW_SRCADDR_REG_OFST           _UINT32_(0x28)      /* (FCW_SRCADDR) System Source Address REGISTER Offset */
#define FCW_DATA_REG_OFST              _UINT32_(0x2C)      /* (FCW_DATA) Flash Write Data n REGISTER Offset */
#define FCW_DATA0_REG_OFST             _UINT32_(0x2C)      /* (FCW_DATA0) Flash Write Data n REGISTER Offset */
#define FCW_DATA1_REG_OFST             _UINT32_(0x30)      /* (FCW_DATA1) Flash Write Data n REGISTER Offset */
#define FCW_DATA2_REG_OFST             _UINT32_(0x34)      /* (FCW_DATA2) Flash Write Data n REGISTER Offset */
#define FCW_DATA3_REG_OFST             _UINT32_(0x38)      /* (FCW_DATA3) Flash Write Data n REGISTER Offset */
#define FCW_SWAP_REG_OFST              _UINT32_(0x4C)      /* (FCW_SWAP) NVM Panel Swap REGISTER Offset */
#define FCW_PWP_REG_OFST               _UINT32_(0x50)      /* (FCW_PWP) PFM Write Protect Region n REGISTER Offset */
#define FCW_PWP0_REG_OFST              _UINT32_(0x50)      /* (FCW_PWP0) PFM Write Protect Region n REGISTER Offset */
#define FCW_PWP1_REG_OFST              _UINT32_(0x54)      /* (FCW_PWP1) PFM Write Protect Region n REGISTER Offset */
#define FCW_PWP2_REG_OFST              _UINT32_(0x58)      /* (FCW_PWP2) PFM Write Protect Region n REGISTER Offset */
#define FCW_PWP3_REG_OFST              _UINT32_(0x5C)      /* (FCW_PWP3) PFM Write Protect Region n REGISTER Offset */
#define FCW_LBWP_REG_OFST              _UINT32_(0x70)      /* (FCW_LBWP) Lower BFM Write Protect REGISTER Offset */
#define FCW_UBWP_REG_OFST              _UINT32_(0x74)      /* (FCW_UBWP) Upper BFM Write Protect REGISTER Offset */
#define FCW_UOWP_REG_OFST              _UINT32_(0x78)      /* (FCW_UOWP) User OTP Write protection REGISTER Offset */
#define FCW_CWP_REG_OFST               _UINT32_(0x7C)      /* (FCW_CWP) CFM Page Write Protect REGISTER Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* FCW register API structure */
typedef struct
{  /* Polaris Flash Write Controller */
  __IO  uint32_t                       FCW_CTRLA;          /* Offset: 0x00 (R/W  32) Control A REGISTER */
  __IO  uint32_t                       FCW_CTRLOP;         /* Offset: 0x04 (R/W  32) Control Operation REGISTER */
  __IO  uint32_t                       FCW_MUTEX;          /* Offset: 0x08 (R/W  32) MUTEX REGISTER */
  __IO  uint32_t                       FCW_INTENCLR;       /* Offset: 0x0C (R/W  32) Interrupt Enable Clear REGISTER */
  __IO  uint32_t                       FCW_INTENSET;       /* Offset: 0x10 (R/W  32) Interrupt Enable Set REGISTER */
  __IO  uint32_t                       FCW_INTFLAG;        /* Offset: 0x14 (R/W  32) Interrupt Flag REGISTER */
  __IO  uint32_t                       FCW_INTFLAGSET;     /* Offset: 0x18 (R/W  32) Interrupt Flag Set REGISTER */
  __I   uint32_t                       FCW_STATUS;         /* Offset: 0x1C (R/   32) Status REGISTER */
  __IO  uint32_t                       FCW_KEY;            /* Offset: 0x20 (R/W  32) Feature Unlock Key REGISTER */
  __IO  uint32_t                       FCW_ADDR;           /* Offset: 0x24 (R/W  32) Flash Destination Address REGISTER */
  __IO  uint32_t                       FCW_SRCADDR;        /* Offset: 0x28 (R/W  32) System Source Address REGISTER */
  __IO  uint32_t                       FCW_DATA[4];        /* Offset: 0x2C (R/W  32) Flash Write Data n REGISTER */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       FCW_SWAP;           /* Offset: 0x4C (R/W  32) NVM Panel Swap REGISTER */
  __IO  uint32_t                       FCW_PWP[4];         /* Offset: 0x50 (R/W  32) PFM Write Protect Region n REGISTER */
  __I   uint8_t                        Reserved2[0x10];
  __IO  uint32_t                       FCW_LBWP;           /* Offset: 0x70 (R/W  32) Lower BFM Write Protect REGISTER */
  __IO  uint32_t                       FCW_UBWP;           /* Offset: 0x74 (R/W  32) Upper BFM Write Protect REGISTER */
  __IO  uint32_t                       FCW_UOWP;           /* Offset: 0x78 (R/W  32) User OTP Write protection REGISTER */
  __IO  uint32_t                       FCW_CWP;            /* Offset: 0x7C (R/W  32) CFM Page Write Protect REGISTER */
} fcw_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_FCW_COMPONENT_H_ */
